net.tangly.fsm/src/site/pics/fsm-bbv.dot
digraph G {
  compound=true;

  Off [style="dashed"];
  Maintenance [];
  subgraph cluster1003 {
    style=invis;
    subgraph cluster3 {
      style="visible, filled";
      label = "On"
      subgraph cluster1004 {
        style=invis;
        subgraph cluster4 {
          style="visible, filled";
          label = "FM"
          Play [style="dashed, filled"];
          AutoTune [];
        }
      }
      DAB [style="dashed"];
    }
  }
  Off -> Maintenance [label="TogglePower[Maintenance is On]/log transition Off to Maintenance"];
  Off -> DAB [lhead=cluster3, label="TogglePower[Maintenance Off]/OfftoOn"];
  Maintenance -> Off [label="TogglePower/MaintainedtoOff"];
  DAB -> Off [ltail=cluster3, label="TogglePower/OntoOff"];
  Play -> DAB [ltail=cluster4, label="ToggleMode/FMtoDAB"];
  Play -> AutoTune [label="StationLost/PlaytoAutoTune"];
  AutoTune -> Play [label="StationFound/AutoTunetoPlay"];
  DAB -> Play [lhead=cluster4, label="ToggleMode/DABtoFM"];
}
